# Work items

- house_type:leave
- address: remove
- region: clean and consolidate, remove rows with nulls
- area: remove rows with nulls, remove > 500
- sup_area: replace null with 0
- rooms: replace nulls by padding
- land_area: replace nulls with 0, remove > 2500 where area < 70. 0 => condo = 1
- monthly_fee: replace nulls with 0
- date_sold: generate year/month
- broker: remove

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from datetime import datetime 

#open the dataset
with open('../data/170829/houses.csv',encoding='latin-1') as f:
    df = pd.read_csv(f)

In [2]:
#drop the columns we dont need
try:
    del df['Unnamed: 0']
except:
    pass
try:
    del df['address']
except:
    pass
try:
    del df['broker']
except:
    pass
try:
    del df['price_change_pct']
except:
    pass

In [3]:
df.count()

house_type     1173
region         1162
area           1161
sup_area        615
rooms          1154
land_area       915
monthly_fee     248
date_sold      1173
price          1173
dtype: int64

In [4]:
df.head(5)

,house_type,region,area,sup_area,rooms,land_area,monthly_fee,date_sold,price
0,Villa,Viby,155.0,NaN,6.0,1232.0,NaN,2017-08-29,7700000
1,Radhus,Norrviken,107.0,10.0,5.0,208.0,NaN,2017-08-28,4765000
2,Villa,Edsviken,208.0,22.0,9.0,1003.0,NaN,2017-08-28,12700000
3,Villa,Norrviken,190.0,103.0,8.0,1389.0,NaN,2017-08-25,12000000
4,Villa,Edsviken,198.0,91.0,7.0,1160.0,NaN,2017-08-25,12100000

In [5]:
#area - remove nulls and remove area > 500
df['area'].fillna(0, inplace=True)
df = df[df.area < 500]

In [6]:
#sup_area - replace nulls with 0
df['sup_area'].fillna(0, inplace=True)

In [7]:
df.count()

house_type     1172
region         1161
area           1172
sup_area       1172
rooms          1153
land_area       914
monthly_fee     248
date_sold      1172
price          1172
dtype: int64

In [8]:
# fix date time
df['date_sold'] = pd.to_datetime(df['date_sold'])
df['year'] = df['date_sold'].dt.year
df['month'] = df['date_sold'].dt.month

In [9]:
df['running_month'] = (df['year']-2013)*12+df['month']

In [10]:
df.head(5)

,house_type,region,area,sup_area,rooms,land_area,monthly_fee,date_sold,price,year,month,running_month
0,Villa,Viby,155.0,0.0,6.0,1232.0,NaN,2017-08-29,7700000,2017,8,56
1,Radhus,Norrviken,107.0,10.0,5.0,208.0,NaN,2017-08-28,4765000,2017,8,56
2,Villa,Edsviken,208.0,22.0,9.0,1003.0,NaN,2017-08-28,12700000,2017,8,56
3,Villa,Norrviken,190.0,103.0,8.0,1389.0,NaN,2017-08-25,12000000,2017,8,56
4,Villa,Edsviken,198.0,91.0,7.0,1160.0,NaN,2017-08-25,12100000,2017,8,56

In [13]:
df.to_csv('../data/170829/starterhouses.csv', index=False)